In [ ]:
import pandas as pd

# Read the data

In [ ]:
df = pd.read_csv('./Uber-dataset/uber-raw-data-apr14.csv', sep=",")
df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

## Remove date/time column and create a new column with hour

In [ ]:
col = df['Date/Time'].tolist()

In [ ]:
k=[]
for i in col:
    i=i.split(' ')
    i=i[1][:-6]
    k.append(i)

In [ ]:
df['hour']=k
df=df.drop(['Date/Time'],axis=1)
df.head()

       Lat      Lon    Base hour
0  40.7690 -73.9549  B02512    0
1  40.7267 -74.0345  B02512    0
2  40.7316 -73.9873  B02512    0
3  40.7588 -73.9776  B02512    0
4  40.7594 -73.9722  B02512    0

### Save the new data frame

In [ ]:
df.to_csv('Mining.dat',sep=',')